CSI API ETABS v1
cDetailing.GetColumnTieRebarData Method
 Retrieves tie (confinement/shear) rebar data for a column frame object
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetColumnTieRebarData(
	string Name,
	ref int NumberRebarSets,
	ref string[] BarSizeName,
	ref double[] BarArea,
	ref int[] Pattern,
	ref int[] ConfineType,
	ref int[] NumberLegs2Dir,
	ref int[] NumberLegs3Dir,
	ref string[] Location,
	ref double[] ClearCover,
	ref double[] StartCoord1,
	ref double[] Spacing,
	ref double[] Heights,
	ref string[] RebarSetGUID
)
Function GetColumnTieRebarData (
	Name As String,
	ByRef NumberRebarSets As Integer,
	ByRef BarSizeName As String(),
	ByRef BarArea As Double(),
	ByRef Pattern As Integer(),
	ByRef ConfineType As Integer(),
	ByRef NumberLegs2Dir As Integer(),
	ByRef NumberLegs3Dir As Integer(),
	ByRef Location As String(),
	ByRef ClearCover As Double(),
	ByRef StartCoord1 As Double(),
	ByRef Spacing As Double(),
	ByRef Heights As Double(),
	ByRef RebarSetGUID As String()
) As Integer
Dim instance As cDetailing
Dim Name As String
Dim NumberRebarSets As Integer
Dim BarSizeName As String()
Dim BarArea As Double()
Dim Pattern As Integer()
Dim ConfineType As Integer()
Dim NumberLegs2Dir As Integer()
Dim NumberLegs3Dir As Integer()
Dim Location As String()
Dim ClearCover As Double()
Dim StartCoord1 As Double()
Dim Spacing As Double()
Dim Heights As Double()
Dim RebarSetGUID As String()
Dim returnValue As Integer
returnValue = instance.GetColumnTieRebarData(Name,
	NumberRebarSets, BarSizeName, BarArea,
	Pattern, ConfineType, NumberLegs2Dir,
	NumberLegs3Dir, Location, ClearCover,
	StartCoord1, Spacing, Heights, RebarSetGUID)
int GetColumnTieRebarData(
	String^ Name,
	int% NumberRebarSets,
	array<String^>^% BarSizeName,
	array<double>^% BarArea,
	array<int>^% Pattern,
	array<int>^% ConfineType,
	array<int>^% NumberLegs2Dir,
	array<int>^% NumberLegs3Dir,
	array<String^>^% Location,
	array<double>^% ClearCover,
	array<double>^% StartCoord1,
	array<double>^% Spacing,
	array<double>^% Heights,
	array<String^>^% RebarSetGUID
)
abstract GetColumnTieRebarData :
        Name : string *
        NumberRebarSets : int byref *
        BarSizeName : string[] byref *
        BarArea : float[] byref *
        Pattern : int[] byref *
        ConfineType : int[] byref *
        NumberLegs2Dir : int[] byref *
        NumberLegs3Dir : int[] byref *
        Location : string[] byref *
        ClearCover : float[] byref *
        StartCoord1 : float[] byref *
        Spacing : float[] byref *
        Heights : float[] byref *
        RebarSetGUID : string[] byref -> int
Parameters
Name
Type: System.String
 The name of an existing beam frame object
NumberRebarSets
Type: System.Int32
 Number of tie rebar sets for this beam object
BarSizeName
Type: System.String[]
 Rebar designation
BarArea
Type: System.Double[]
 Individual rebar area
Pattern
Type: System.Int32[]
 Rebar pattern - 1 - Rectangular, 2 - Circular
ConfineType
Type: System.Int32[]
 Confinement type - 1 - Ties, 2 - Spiral (Spiral only possible when Pattern is Circular)
NumberLegs2Dir
Type: System.Int32[]
 Number of legs for ties in this set along the local 2 direction)
NumberLegs3Dir
Type: System.Int32[]
 Number of legs for ties in this set along the local 3 direction)
Location
Type: System.String[]
 Zone of this set of rebars - A, B, C, etc. (See picture for seismic/ non-seismic detailing)
ClearCover
Type: System.Double[]
 Clear cover from face to ties being specified
StartCoord1
Type: System.Double[]
 Start of this set of tie rebars from start/end (depends on location) of column object
Spacing
Type: System.Double[]
 Spacing of ties
Heights
Type: System.Double[]
 Height over which these tie bars are provided from start point
RebarSetGUID
Type: System.String[]
 The GUIDs of each of the rebar sets (could be duplicated for adjacent beam if rebars are continuous)
Return Value
Type: Int32
 Returns zero if the rebar data is successfully retrieved; otherwise it returns a nonzero value.
See Also
Reference
cDetailing Interface
ETABSv1 Namespace